Repository: noah-qin/Corta
Catalog: Corta/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# settings.status.openFileCommand
source: “Open file with” needs an absolute path and only {file}, {line} and {column}; it was left unchanged.
de: „Datei öffnen mit“ benötigt einen absoluten Pfad und nur {file}, {line} und {column}; die Einstellung wurde nicht geändert.
es: “Abrir archivo con” necesita una ruta absoluta y solo {file}, {line} y {column}; no se ha modificado.
fr: « Ouvrir le fichier avec » nécessite un chemin absolu et uniquement {file}, {line} et {column} ; la valeur n’a pas été modifiée.
ja: 「ファイルを開くコマンド」には絶対パスと {file}、{line}、{column} のみを指定できます。変更していません。
ko: ‘파일 열기 명령’에는 절대 경로와 {file}, {line}, {column}만 사용할 수 있습니다. 변경하지 않았습니다.
pt_br: “Abrir arquivo com” precisa de um caminho absoluto e apenas {file}, {line} e {column}; o valor não foi alterado.
zh_hans: “打开文件方式”需要绝对路径，且只能使用 {file}、{line} 和 {column}；已保持原值。
zh_hant: 「打開檔案方式」需要絕對路徑，且只能使用 {file}、{line} 和 {column}；已保持原值。

# clear.history.title
source: Clear this pane’s history?
de: Verlauf dieses Bereichs löschen?
es: ¿Borrar el historial de este panel?
fr: Effacer l’historique de ce volet ?
ja: このペインの履歴を消去しますか？
ko: 이 페인의 기록을 지우시겠습니까?
pt_br: Apagar o histórico deste painel?
zh_hans: 要清除此窗格的历史记录吗？
zh_hant: 要清除此窗格的歷史記錄嗎？

# clear.reset.title
source: Reset this terminal?
de: Dieses Terminal zurücksetzen?
es: ¿Restablecer este terminal?
fr: Réinitialiser ce terminal ?
ja: このターミナルをリセットしますか？
ko: 이 터미널을 재설정하시겠습니까?
pt_br: Redefinir este terminal?
zh_hans: 要重置此终端吗？
zh_hant: 要重置此終端機嗎？

# clear.history.detail
source: %1$lld lines of scrollback will be discarded. This cannot be undone.
de: %1$lld Zeilen des Verlaufs werden verworfen. Dies kann nicht widerrufen werden.
es: Se descartarán %1$lld líneas del historial. Esta acción no se puede deshacer.
fr: %1$lld lignes d’historique seront supprimées. Cette action est irréversible.
ja: スクロールバック %1$lld 行が破棄されます。この操作は取り消せません。
ko: 스크롤백 %1$lld줄이 삭제됩니다. 이 작업은 취소할 수 없습니다.
pt_br: %1$lld linhas do histórico serão descartadas. Esta ação não pode ser desfeita.
zh_hans: 将丢弃 %1$lld 行回滚内容。此操作无法撤销。
zh_hant: 將捨棄 %1$lld 行捲動記錄。此操作無法還原。

# clear.history.discard
source: Discard
de: Verwerfen
es: Descartar
fr: Supprimer
ja: 破棄
ko: 삭제
pt_br: Descartar
zh_hans: 丢弃
zh_hant: 捨棄

# menu.presetInWindow
source: %1$@ in New Window
de: „%1$@“ in neuem Fenster
es: %1$@ en una ventana nueva
fr: %1$@ dans une nouvelle fenêtre
ja: %1$@ を新規ウィンドウで開く
ko: 새 윈도우에서 %1$@ 열기
pt_br: %1$@ em nova janela
zh_hans: 在新窗口中打开“%1$@”
zh_hant: 在新視窗中打開「%1$@」

# toast.pasteStopped
source: Paste stopped — the shell isn’t reading input.
de: Einfügen gestoppt – die Shell liest keine Eingabe.
es: Pegado detenido: el shell no está leyendo la entrada.
fr: Collage interrompu — le shell ne lit pas les entrées.
ja: 貼り付けを中断しました—シェルが入力を読み取っていません。
ko: 붙여넣기가 중단되었습니다 — 쉘이 입력을 읽지 않고 있습니다.
pt_br: Colagem interrompida — o shell não está lendo a entrada.
zh_hans: 粘贴已停止——Shell 未在读取输入。
zh_hant: 貼上已停止——Shell 未讀取輸入。

# toast.shellExited
source: The shell exited.
de: Die Shell wurde beendet.
es: El shell ha terminado.
fr: Le shell s’est arrêté.
ja: シェルが終了しました。
ko: 쉘이 종료되었습니다.
pt_br: O shell foi encerrado.
zh_hans: Shell 已退出。
zh_hant: Shell 已結束。

# duration.minutes
source: %lldm
de: %lld Min.
es: %lld min
fr: %lld min
ja: %lld分
ko: %lld분
pt_br: %lld min
zh_hans: %lld分钟
zh_hant: %lld分鐘

# duration.minutesSeconds
source: %lldm %llds
de: %lld Min. %lld Sek.
es: %lld min %lld s
fr: %lld min %lld s
ja: %lld分%lld秒
ko: %lld분 %lld초
pt_br: %lld min %lld s
zh_hans: %lld分%lld秒
zh_hant: %lld分%lld秒

# duration.hoursMinutes
source: %lldh %lldm
de: %lld Std. %lld Min.
es: %lld h %lld min
fr: %lld h %lld min
ja: %lld時間%lld分
ko: %lld시간 %lld분
pt_br: %lld h %lld min
zh_hans: %lld小时%lld分钟
zh_hant: %lld小時%lld分鐘

# toast.noCommandRunning
source: No command is currently running
de: Es läuft derzeit kein Befehl
es: No hay ningún comando en ejecución
fr: Aucune commande en cours d'exécution
ja: 実行中のコマンドはありません
ko: 현재 실행 중인 명령이 없습니다
pt_br: Nenhum comando em execução no momento
zh_hans: 当前没有正在运行的命令
zh_hant: 當前沒有正在執行的命令

# snapshot.header
source: — snapshot taken %@ —
de: — Schnappschuss vom %@ —
es: — instantánea tomada el %@ —
fr: — instantané pris le %@ —
ja: — %@ に取得したスナップショット —
ko: — %@ 에 찍은 스냅샷 —
pt_br: — snapshot tirado em %@ —
zh_hans: — 于 %@ 拍摄的快照 —
zh_hant: — 於 %@ 擷取的快照 —

# toast.snapshotCopied
source: Copied a snapshot of the running command's output
de: Schnappschuss der Ausgabe des laufenden Befehls kopiert
es: Se copió una instantánea de la salida del comando en ejecución
fr: Instantané de la sortie de la commande en cours copié
ja: 実行中のコマンドの出力のスナップショットをコピーしました
ko: 실행 중인 명령의 출력 스냅샷을 복사했습니다
pt_br: Snapshot da saída do comando em execução copiado
zh_hans: 已拷贝正在运行命令的输出快照
zh_hant: 已拷貝正在執行命令的輸出快照

# settings.help.shellIntegration
source: Lets Corta see where each command starts, ends and whether it failed. Installs into ~/.zshrc, reversibly.
de: Ermöglicht Corta zu erkennen, wo jeder Befehl beginnt, endet und ob er fehlgeschlagen ist. Wird reversibel in ~/.zshrc installiert.
es: Permite que Corta sepa dónde empieza y termina cada comando, y si falló. Se instala de forma reversible en ~/.zshrc.
fr: Permet à Corta de savoir où chaque commande commence, se termine et si elle a échoué. Installation réversible dans ~/.zshrc.
ja: 各コマンドの開始位置、終了位置、失敗したかどうかを Corta が把握できるようになります。~/.zshrc に可逆的にインストールします。
ko: 각 명령이 어디서 시작되고 끝났는지, 실패했는지를 Corta가 알 수 있게 합니다. ~/.zshrc에 되돌릴 수 있게 설치됩니다.
pt_br: Permite que o Corta saiba onde cada comando começa, termina e se falhou. Instalado de forma reversível em ~/.zshrc.
zh_hans: 让 Corta 知道每条命令在哪里开始、结束及是否失败。以可逆的方式安装到 ~/.zshrc。
zh_hant: 讓 Corta 知道每個命令在哪裡開始、結束以及是否失敗。以可還原的方式安裝到 ~/.zshrc。

# settings.status.shellIntegrationNotInstalled
source: Not installed
de: Nicht installiert
es: No instalada
fr: Non installée
ja: 未インストール
ko: 설치되지 않음
pt_br: Não instalada
zh_hans: 未安装
zh_hant: 尚未安裝

# settings.status.shellIntegrationInstalled
source: Installed in ~/.zshrc
de: In ~/.zshrc installiert
es: Instalada en ~/.zshrc
fr: Installée dans ~/.zshrc
ja: ~/.zshrc にインストール済み
ko: ~/.zshrc에 설치됨
pt_br: Instalada em ~/.zshrc
zh_hans: 已安装到 ~/.zshrc
zh_hant: 已安裝至 ~/.zshrc

# settings.status.shellIntegrationConflict
source: May conflict with %@'s own shell integration
de: Könnte mit der eigenen Shell-Integration von %@ kollidieren
es: Puede entrar en conflicto con la propia integración de shell de %@
fr: Peut entrer en conflit avec l'intégration shell de %@
ja: %@ 自身のシェル統合と競合する可能性があります
ko: %@ 자체의 셸 통합과 충돌할 수 있습니다
pt_br: Pode conflitar com a própria integração de shell do %@
zh_hans: 可能与 %@ 自身的 Shell 集成冲突
zh_hant: 可能與 %@ 自身的 Shell 整合衝突

# settings.status.shellIntegrationWriteFailed
source: Couldn't update ~/.zshrc
de: ~/.zshrc konnte nicht aktualisiert werden
es: No se pudo actualizar ~/.zshrc
fr: Impossible de mettre à jour ~/.zshrc
ja: ~/.zshrc を更新できませんでした
ko: ~/.zshrc를 업데이트하지 못했습니다
pt_br: Não foi possível atualizar o ~/.zshrc
zh_hans: 无法更新 ~/.zshrc
zh_hant: 無法更新 ~/.zshrc

# settings.action.install
source: Install
de: Installieren
es: Instalar
fr: Installer
ja: インストール
ko: 설치
pt_br: Instalar
zh_hans: 安装
zh_hant: 安裝

# settings.action.installAnyway
source: Install Anyway
de: Trotzdem installieren
es: Instalar de todos modos
fr: Installer quand même
ja: それでもインストール
ko: 그래도 설치
pt_br: Instalar mesmo assim
zh_hans: 仍然安装
zh_hant: 仍要安裝

# settings.action.remove
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer
ja: 削除
ko: 제거
pt_br: Remover
zh_hans: 移除
zh_hant: 移除

# command.snapshotRunningCommandOutput
source: Snapshot Running Command’s Output
de: Schnappschuss der laufenden Befehlsausgabe
es: Instantánea de la salida del comando en ejecución
fr: Instantané de la sortie de la commande en cours
ja: 実行中のコマンドの出力のスナップショットを取得
ko: 실행 중인 명령 출력 스냅샷
pt_br: Snapshot da saída do comando em execução
zh_hans: 为正在运行的命令的输出拍摄快照
zh_hant: 為正在執行命令的輸出擷取快照

# about.version
source: Version %@ (%@)
es: Versión %@ (%@)
ja: バージョン %@（%@）
ko: 버전 %@ (%@)
pt_br: Versão %@ (%@)
zh_hans: 版本 %@（%@）
zh_hant: 版本 %@（%@）

# about.website
source: Website
es: Sitio web
fr: Site web
ja: Webサイト
ko: 웹사이트
pt_br: Site
zh_hans: 网站
zh_hant: 網站

# settings.font.systemMonospaced
source: System Monospaced
es: Monoespaciada del sistema
fr: Police système à largeur fixe
ja: システム等幅
ko: 시스템 고정폭
pt_br: Monoespaçada do sistema
zh_hans: 系统等宽字体
zh_hant: 系統等寬字體

# settings.label.scrollback
source: Scrollback
es: Desplazamiento
fr: Défilement
ja: スクロールバック
ko: 스크롤백
pt_br: Rolagem
zh_hans: 滚动回看
zh_hant: 捲動回看

# settings.label.shellIntegration
source: Shell Integration
es: Integración del shell
fr: Intégration du shell
ja: シェル統合
ko: 셸 통합
pt_br: Integração com o shell
zh_hans: Shell 集成
zh_hant: Shell 整合

# a11y.terminal.label
source: Terminal
ja: ターミナル
ko: 터미널
zh_hans: 终端
zh_hant: 終端機

# menu.shell
source: Shell
ja: シェル
ko: 셸

# settings.tab.terminal
source: Terminal
ja: ターミナル
ko: 터미널
zh_hans: 终端
zh_hant: 終端機

# commandPalette.category.terminal
source: Terminal
ja: ターミナル
ko: 터미널
zh_hans: 终端
zh_hant: 終端機

# duration.seconds
source: %llds
ja: %lld秒
ko: %lld초
zh_hans: %lld秒
zh_hant: %lld秒
